Функция СоздатьSQLСоединение() Экспорт
	
	http = Новый HTTPСоединение("localhost", 8080);
	path = "/api/v1/connection";
	json_body = СериализоватьВJSON(
		Новый Структура(
			"host,port,user,password,db_type,db_name,ssl",
			"127.0.0.1", 5432, "postgres", "postgres", "postgres", "test", Ложь
	));                        
	
	headers = Новый Соответствие;
	headers.Вставить("Content-Type", "application/json;charset=UTF-8");	
	
	query = Новый HTTPЗапрос(path, headers);
	query.УстановитьТелоИзСтроки(json_body);

	Ответ = http.ВызватьHTTPМетод("POST", query);
	КодРезультата = Ответ.КодСостояния;
	SQLСоединение = Ответ.ПолучитьТелоКакСтроку();
	Если КодРезультата = 200 Тогда	
		Возврат SQLСоединение;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Процедура УдалитьSQLСоединение(SQLСоединение) Экспорт
	
	http = Новый HTTPСоединение("localhost", 8080);
	path = "/api/v1/connection";
	
	headers = Новый Соответствие;
	headers.Вставить("Connection-Id", SQLСоединение);	
	
	query = Новый HTTPЗапрос(path, headers);

	Ответ = http.ВызватьHTTPМетод("DELETE", query);
	КодРезультата = Ответ.КодСостояния;
	Результат = Ответ.ПолучитьТелоКакСтроку();
	Если КодРезультата = 200 Тогда	
		SQLСоединение = "";
	КонецЕсли;

КонецПроцедуры

Функция ЗапросВыборкаДанных(SQLСоединение, SQLЗапрос) Экспорт
	
	http = Новый HTTPСоединение("localhost", 8080);
	path = "/api/v1/query";                        	

	headers = Новый Соответствие;
	headers.Вставить("Connection-Id", SQLСоединение);	
	headers.Вставить("SQL-Statement", КодироватьСтроку(SQLЗапрос, СпособКодированияСтроки.КодировкаURL));	

	query = Новый HTTPЗапрос(path, headers);
	
	Ответ = http.ВызватьHTTPМетод("GET", query);
	КодРезультата = Ответ.КодСостояния;
	Если КодРезультата = 200 Тогда	
		Результат = Ответ.ПолучитьТелоКакСтроку();
		Возврат ДесериализоватьИзJSON(Результат);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Процедура ЗапросИзменениеДанных(SQLСоединение, SQLЗапрос) Экспорт
	
	http = Новый HTTPСоединение("localhost", 8080);
	path = "/api/v1/query";
	
	headers = Новый Соответствие;
	headers.Вставить("Connection-Id", SQLСоединение);	
	headers.Вставить("SQL-Statement", КодироватьСтроку(SQLЗапрос, СпособКодированияСтроки.КодировкаURL));	
	
	query = Новый HTTPЗапрос(path, headers);

	Ответ = http.ВызватьHTTPМетод("POST", query);
	КодРезультата = Ответ.КодСостояния;

КонецПроцедуры

Функция ДесериализоватьИзJSON(СтрокаJSON, ПоляДата = "")
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
    Значение = ПрочитатьJSON(ЧтениеJSON,, ПоляДата, ФорматДатыJSON.ISO);          
    ЧтениеJSON.Закрыть();
    Возврат Значение;
    
КонецФункции
