#Область ПрограммныйИнтерфейс

// Создает или получает новое соединение с SQL-сервером
// Возвращаемое значение: 
// 		GUID соединения - Строка
Функция СоздатьSQLСоединение() Экспорт
	
	http = Новый HTTPСоединение("localhost", 8080);
	path = "/api/v1/connection";
	json_body = СериализоватьВJSON(
		Новый Структура(
			"host,port,user,password,db_type,db_name,ssl",
			"127.0.0.1", 5432, "postgres", "postgres", "postgres", "test", Ложь
	));                        
	
	headers = Новый Соответствие;
	headers.Вставить("API-Version", "1.2");	
	headers.Вставить("Content-Type", "application/json;charset=UTF-8");	
	
	query = Новый HTTPЗапрос(path, headers);
	query.УстановитьТелоИзСтроки(json_body);

	Ответ = http.ВызватьHTTPМетод("POST", query);
	КодРезультата = Ответ.КодСостояния;
	SQLСоединение = Ответ.ПолучитьТелоКакСтроку();
	Если КодРезультата = 200 Тогда	
		Возврат SQLСоединение;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Закрывает и удаляет соединение с SQL-сервером
// Параметры: 
// 		SQLСоединение - Строка - GUID открытого соединения
Процедура УдалитьSQLСоединение(SQLСоединение) Экспорт
	
	http = Новый HTTPСоединение("localhost", 8080);
	path = "/api/v1/connection";
	
	headers = Новый Соответствие;
	headers.Вставить("API-Version", "1.2");	
	headers.Вставить("Connection-Id", SQLСоединение);	
	
	query = Новый HTTPЗапрос(path, headers);

	Ответ = http.ВызватьHTTPМетод("DELETE", query);
	КодРезультата = Ответ.КодСостояния;
	Результат = Ответ.ПолучитьТелоКакСтроку();
	Если КодРезультата = 200 Тогда	
		SQLСоединение = "";
	КонецЕсли;

КонецПроцедуры

// Выполняет обычные SQL-запросы вида выборки таблиц
// Параметры: 
// 		SQLСоединение - Строка - GUID открытого соединения
// 		SQLЗапрос 	  - Строка - Текст SQL-запроса
// Возвращаемое значение: 
// 		Результат запроса - Структура, содержащая массив структур - результат выборки запроса
Функция ЗапросВыборкаДанных(SQLСоединение, SQLЗапрос) Экспорт
	
	http = Новый HTTPСоединение("localhost", 8080);
	path = "/api/v1/query";                        	

	headers = Новый Соответствие;
	headers.Вставить("API-Version", "1.2");	
	headers.Вставить("Connection-Id", SQLСоединение);	
	headers.Вставить("Content-Type", "text/plain;charset=UTF-8");	

	query = Новый HTTPЗапрос(path, headers);
	query.УстановитьТелоИзСтроки(SQLЗапрос);
	
	Ответ = http.ВызватьHTTPМетод("POST", query);
	КодРезультата = Ответ.КодСостояния;
	Если КодРезультата = 200 Тогда	
		Возврат ДесериализоватьИзJSON(Ответ.ПолучитьТелоКакСтроку());
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

// Выполняет SQL-запросы вида изменения таблиц (INSERT, UPDATE, DELETE и т.д.)
// Параметры: 
// 		SQLСоединение - Строка - GUID открытого соединения
// 		SQLЗапрос 	  - Строка - Текст SQL-запроса
Процедура ЗапросИзменениеДанных(SQLСоединение, SQLЗапрос) Экспорт
	
	http = Новый HTTPСоединение("localhost", 8080);
	path = "/api/v1/query";
	
	headers = Новый Соответствие;
	headers.Вставить("API-Version", "1.2");	
	headers.Вставить("Connection-Id", SQLСоединение);	
	headers.Вставить("Content-Type", "text/plain;charset=UTF-8");	
	
	query = Новый HTTPЗапрос(path, headers);
	query.УстановитьТелоИзСтроки(SQLЗапрос);

	Ответ = http.ВызватьHTTPМетод("PUT", query);
	КодРезультата = Ответ.КодСостояния;

КонецПроцедуры

// Создает подготовленный оператор (Prepared statement)
// Параметры: 
// 		SQLСоединение - Строка - GUID открытого соединения
// 		SQLЗапрос 	  - Строка - Текст SQL-запроса
// Возвращаемое значение: 
// 		GUID оператора - Строка
Функция СоздатьПодготовленныйОператор(SQLСоединение, SQLЗапрос) Экспорт

	http = Новый HTTPСоединение("localhost", 8080);
	path = "/api/v1/prepared";
	
	headers = Новый Соответствие;
	headers.Вставить("API-Version", "1.2");	
	headers.Вставить("Connection-Id", Соединение);	
	headers.Вставить("Content-Type", "text/plain;charset=UTF-8");	
	
	query = Новый HTTPЗапрос(path, headers);
	query.УстановитьТелоИзСтроки(SQLЗапрос);

	Ответ = http.ВызватьHTTPМетод("POST", query);
	КодРезультата = Ответ.КодСостояния;
	Результат = Ответ.ПолучитьТелоКакСтроку();
	Если КодРезультата = 200 Тогда	
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

// Удаляет подготовленный оператор (Prepared statement)
// Параметры: 
// 		SQLСоединение - Строка - GUID открытого соединения
// 		SQLОператор   - Строка - GUID оператора
Процедура УдалитьПодготовленныйОператор(SQLСоединение, SQLОператор) Экспорт
	
	http = Новый HTTPСоединение("localhost", 8080);
	path = "/api/v1/prepared";
	
	headers = Новый Соответствие;
	headers.Вставить("API-Version", "1.2");	
	headers.Вставить("Connection-Id", SQLСоединение);	
	headers.Вставить("Statement-Id", SQLОператор);	
	
	query = Новый HTTPЗапрос(path, headers);

	Ответ = http.ВызватьHTTPМетод("DELETE", query);
	КодРезультата = Ответ.КодСостояния;

КонецПроцедуры

// Выполнить подготовленный оператор (Prepared statement) с выборкой данных
// Параметры: 
// 		SQLСоединение - Строка - GUID открытого соединения
// 		SQLОператор   - Строка - GUID оператора
// 		Парам   	  - Массив - Параметры для подготовленного оператора
// Возвращаемое значение: 
// 		Результат запроса - Структура, содержащая массив структур - результат выборки запроса
Функция ВыполнитьПодготовленныйОператорВыборка(SQLСоединение, SQLОператор, Парам) Экспорт
	
	http = Новый HTTPСоединение("localhost", 8080);
	path = "/api/v1/prepared/query";
	
	headers = Новый Соответствие;
	headers.Вставить("API-Version", "1.2");	
	headers.Вставить("Connection-Id", Соединение);	
	headers.Вставить("Statement-Id", Оператор);	
	headers.Вставить("Content-Type", "application/json;charset=UTF-8");	

	ПараметрыJSON = СериализоватьВJSON(Парам);	

	query = Новый HTTPЗапрос(path, headers);	
	query.УстановитьТелоИзСтроки(ПараметрыJSON);

	Ответ = http.ВызватьHTTPМетод("POST", query);
	КодРезультата = Ответ.КодСостояния;
	
	Если КодРезультата = 200 Тогда	
		Возврат ДесериализоватьИзJSON(Ответ.ПолучитьТелоКакСтроку());
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

// Выполнить подготовленный оператор (Prepared statement) на изменение данных
// Параметры: 
// 		SQLСоединение - Строка - GUID открытого соединения
// 		SQLОператор   - Строка - GUID оператора
// 		Парам   	  - Массив - Параметры для подготовленного оператора
Процедура ВыполнитьПодготовленныйОператорИзменение(SQLСоединение, SQLОператор, Парам) Экспорт
	
	http = Новый HTTPСоединение("localhost", 8080);
	path = "/api/v1/prepared/query";
	
	headers = Новый Соответствие;
	headers.Вставить("API-Version", "1.2");	
	headers.Вставить("Connection-Id", Соединение);	
	headers.Вставить("Statement-Id", Оператор);	
	headers.Вставить("Content-Type", "application/json;charset=UTF-8");	

	ПараметрыJSON = СериализоватьВJSON(Парам);	

	query = Новый HTTPЗапрос(path, headers);	
	query.УстановитьТелоИзСтроки(ПараметрыJSON);

	Ответ = http.ВызватьHTTPМетод("PUT", query);
	КодРезультата = Ответ.КодСостояния;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СериализоватьВJSON(Значение) Экспорт
    
    Настройки = Новый НастройкиСериализацииJSON();
    Настройки.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
    Настройки.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
    
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, Значение, Настройки);
    СтрокаJSON = ЗаписьJSON.Закрыть();
    
    Возврат СтрокаJSON;
    
КонецФункции

Функция ДесериализоватьИзJSON(СтрокаJSON, ПоляДата = "")
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
    Значение = ПрочитатьJSON(ЧтениеJSON,, ПоляДата, ФорматДатыJSON.ISO);          
    ЧтениеJSON.Закрыть();
    Возврат Значение;
    
КонецФункции

#КонецОбласти
